"""Создайте программу «Фирма». 
Нужно хранить ин- формацию о человеке: ФИО, телефон, рабочий email, название должности, номер кабинета, skype. 
Требуется реализовать возможность добавления, удаления, поиcка, замены данных. 
Используйте словарь для хранения информации."""

from pprint import pprint

workers = {
    "Вита Мовчан": [733513384, "vita@gmail.com", "cook", 1, "Vita"],
    "Виктория Мусий": [715489620, "vika@gmail.com", "confectioner", 2, "Vika"],
    "Катя Павлова": [751369147, "katya@gmail.com", "taster", 3, "Katya"],
    "Мирослава Мусий": [76398456, "natalia@gmail.com", "chief-cooker", 4, "Daniel"]
    }  
pprint(workers)
print("==========================================")

# ==================================================================
# ================ Добавление ======================================
# ==================================================================
new_workers = input("Введите имя и фамилию нового работника: ")
number = input("Введите номер телефона сотрудника: ")
e_mail = input("Введите е-mail: ")
position = input("Ввдите должность: ")
room_number = input("Введите номер кабинета: ")
skype = input("Введите skype: ")
date = [number, e_mail, position, room_number, skype]
workers[new_workers] = date
pprint(workers)
print("==========================================")

# ==================================================================
# ================ Удаление ========================================
# ==================================================================
dell_w = input("Введите имя и фамилию сотрудника, которого необходимо удалить из списка работников: ")
if dell_w in workers.keys():
    del workers[dell_w]
    pprint(workers)
else:
    print("Такой человек не работает в этой фирме")
print("==========================================")

# ==================================================================
# ===================== Поиск ======================================
# ==================================================================
search_w = input("Введите имя и фамилию работника для получения информации о нём: " )
if search_w in workers.keys():
    h_p = workers.get(search_w)
    print("Номер телефона: {h_p[0]}, рабочая электронная почта: {h_p[1]}, должность: {h_p[2]}, номер офиса: {h_p[3]}, скайп: {h_p[4]}")
else:
    print("Такого сотрудника не существует")
print("==========================================")

# ==================================================================
# ===================== Замена данных ==============================
# ==================================================================
p = input("Введите имя и фамилию работника, данные о котором необходимо скорректировать: ")
new_number = input("Введите номер телефона сотрудника: ")
new_e_mail = input("Введите е-mail: ")
new_position = input("Введите должность: ")
new_room_number = input("Введите номер кабинета: ")
new_skype = input("Введите skype: ")
new_date = [number, e_mail, position, room_number, skype]
workers.update({p : new_date})
print(f"Новый словарь: {workers}")
print("==========================================")

